Revit 2027 API
StructuralInstanceUsageFilter.StructuralUsage Property
 The family instance structural usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralInstanceUsage StructuralUsage { get; }
Public ReadOnly Property StructuralUsage As StructuralInstanceUsage
	Get
public:
property StructuralInstanceUsage StructuralUsage {
	StructuralInstanceUsage get ();
}
member StructuralUsage : StructuralInstanceUsage with get
Property Value
StructuralInstanceUsage
See Also
Reference
StructuralInstanceUsageFilter Class
Autodesk.Revit.DB.Structure Namespace